Revit 2027 API
SpecTypeId.Reference.FillPattern Property
 Fill Pattern, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FillPattern { get; }
Public Shared ReadOnly Property FillPattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FillPattern {
	ForgeTypeId^ get ();
}
static member FillPattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace